["```py\nText Generation Launcher\n\nUsage: text-generation-launcher [OPTIONS]\n\nOptions:\n```", "```py\n      --model-id <MODEL_ID>\n          The name of the model to load. Can be a MODEL_ID as listed on <https://hf.co/models> like `gpt2` or `OpenAssistant/oasst-sft-1-pythia-12b`. Or it can be a local directory containing the necessary files as saved by `save_pretrained(...)` methods of transformers\n\n          [env: MODEL_ID=]\n          [default: bigscience/bloom-560m]\n\n```", "```py\n      --revision <REVISION>\n          The actual revision of the model if you're referring to a model on the hub. You can use a specific commit id or a branch like `refs/pr/2`\n\n          [env: REVISION=]\n\n```", "```py\n      --validation-workers <VALIDATION_WORKERS>\n          The number of tokenizer workers used for payload validation and truncation inside the router\n\n          [env: VALIDATION_WORKERS=]\n          [default: 2]\n\n```", "```py\n      --sharded <SHARDED>\n          Whether to shard the model across multiple GPUs By default text-generation-inference will use all available GPUs to run the model. Setting it to `false` deactivates `num_shard`\n\n          [env: SHARDED=]\n          [possible values: true, false]\n\n```", "```py\n      --num-shard <NUM_SHARD>\n          The number of shards to use if you don't want to use all GPUs on a given machine. You can use `CUDA_VISIBLE_DEVICES=0,1 text-generation-launcher... --num_shard 2` and `CUDA_VISIBLE_DEVICES=2,3 text-generation-launcher... --num_shard 2` to launch 2 copies with 2 shard each on a given machine with 4 GPUs for instance\n\n          [env: NUM_SHARD=]\n\n```", "```py\n      --quantize <QUANTIZE>\n          Whether you want the model to be quantized\n\n          [env: QUANTIZE=]\n\n          Possible values:\n          - awq:              4 bit quantization. Requires a specific AWQ quantized model: https://hf.co/models?search=awq. Should replace GPTQ models wherever possible because of the better latency\n          - eetq:             8 bit quantization, doesn't require specific model. Should be a drop-in replacement to bitsandbytes with much better performance. Kernels are from https://github.com/NetEase-FuXi/EETQ.git\n          - gptq:             4 bit quantization. Requires a specific GTPQ quantized model: https://hf.co/models?search=gptq. text-generation-inference will use exllama (faster) kernels wherever possible, and use triton kernel (wider support) when it's not. AWQ has faster kernels\n          - bitsandbytes:     Bitsandbytes 8bit. Can be applied on any model, will cut the memory requirement in half, but it is known that the model will be much slower to run than the native f16\n          - bitsandbytes-nf4: Bitsandbytes 4bit. Can be applied on any model, will cut the memory requirement by 4x, but it is known that the model will be much slower to run than the native f16\n          - bitsandbytes-fp4: Bitsandbytes 4bit. nf4 should be preferred in most cases but maybe this one has better perplexity performance for you model\n\n```", "```py\n      --speculate <SPECULATE>\n          The number of input_ids to speculate on If using a medusa model, the heads will be picked up automatically Other wise, it will use n-gram speculation which is relatively free in terms of compute, but the speedup heavily depends on the task\n\n          [env: SPECULATE=]\n\n```", "```py\n      --dtype <DTYPE>\n          The dtype to be forced upon the model. This option cannot be used with `--quantize`\n\n          [env: DTYPE=]\n          [possible values: float16, bfloat16]\n\n```", "```py\n      --trust-remote-code\n          Whether you want to execute hub modelling code. Explicitly passing a `revision` is encouraged when loading a model with custom code to ensure no malicious code has been contributed in a newer revision\n\n          [env: TRUST_REMOTE_CODE=]\n\n```", "```py\n      --max-concurrent-requests <MAX_CONCURRENT_REQUESTS>\n          The maximum amount of concurrent requests for this particular deployment. Having a low limit will refuse clients requests instead of having them wait for too long and is usually good to handle backpressure correctly\n\n          [env: MAX_CONCURRENT_REQUESTS=]\n          [default: 128]\n\n```", "```py\n      --max-best-of <MAX_BEST_OF>\n          This is the maximum allowed value for clients to set `best_of`. Best of makes `n` generations at the same time, and return the best in terms of overall log probability over the entire generated sequence\n\n          [env: MAX_BEST_OF=]\n          [default: 2]\n\n```", "```py\n      --max-stop-sequences <MAX_STOP_SEQUENCES>\n          This is the maximum allowed value for clients to set `stop_sequences`. Stop sequences are used to allow the model to stop on more than just the EOS token, and enable more complex \"prompting\" where users can preprompt the model in a specific way and define their \"own\" stop token aligned with their prompt\n\n          [env: MAX_STOP_SEQUENCES=]\n          [default: 4]\n\n```", "```py\n      --max-top-n-tokens <MAX_TOP_N_TOKENS>\n          This is the maximum allowed value for clients to set `top_n_tokens`. `top_n_tokens is used to return information about the the `n` most likely tokens at each generation step, instead of just the sampled token. This information can be used for downstream tasks like for classification or ranking\n\n          [env: MAX_TOP_N_TOKENS=]\n          [default: 5]\n\n```", "```py\n      --max-input-length <MAX_INPUT_LENGTH>\n          This is the maximum allowed input length (expressed in number of tokens) for users. The larger this value, the longer prompt users can send which can impact the overall memory required to handle the load. Please note that some models have a finite range of sequence they can handle\n\n          [env: MAX_INPUT_LENGTH=]\n          [default: 1024]\n\n```", "```py\n      --max-total-tokens <MAX_TOTAL_TOKENS>\n          This is the most important value to set as it defines the \"memory budget\" of running clients requests. Clients will send input sequences and ask to generate `max_new_tokens` on top. with a value of `1512` users can send either a prompt of `1000` and ask for `512` new tokens, or send a prompt of `1` and ask for `1511` max_new_tokens. The larger this value, the larger amount each request will be in your RAM and the less effective batching can be\n\n          [env: MAX_TOTAL_TOKENS=]\n          [default: 2048]\n\n```", "```py\n      --waiting-served-ratio <WAITING_SERVED_RATIO>\n          This represents the ratio of waiting queries vs running queries where you want to start considering pausing the running queries to include the waiting ones into the same batch. `waiting_served_ratio=1.2` Means when 12 queries are waiting and there's only 10 queries left in the current batch we check if we can fit those 12 waiting queries into the batching strategy, and if yes, then batching happens delaying the 10 running queries by a `prefill` run.\n\n          This setting is only applied if there is room in the batch as defined by `max_batch_total_tokens`.\n\n          [env: WAITING_SERVED_RATIO=]\n          [default: 1.2]\n\n```", "```py\n      --max-batch-prefill-tokens <MAX_BATCH_PREFILL_TOKENS>\n          Limits the number of tokens for the prefill operation. Since this operation take the most memory and is compute bound, it is interesting to limit the number of requests that can be sent\n\n          [env: MAX_BATCH_PREFILL_TOKENS=]\n          [default: 4096]\n\n```", "```py\n      --max-batch-total-tokens <MAX_BATCH_TOTAL_TOKENS>\n          **IMPORTANT** This is one critical control to allow maximum usage of the available hardware.\n\n          This represents the total amount of potential tokens within a batch. When using padding (not recommended) this would be equivalent of `batch_size` * `max_total_tokens`.\n\n          However in the non-padded (flash attention) version this can be much finer.\n\n          For `max_batch_total_tokens=1000`, you could fit `10` queries of `total_tokens=100` or a single query of `1000` tokens.\n\n          Overall this number should be the largest possible amount that fits the remaining memory (after the model is loaded). Since the actual memory overhead depends on other parameters like if you're using quantization, flash attention or the model implementation, text-generation-inference cannot infer this number automatically.\n\n          [env: MAX_BATCH_TOTAL_TOKENS=]\n\n```", "```py\n      --max-waiting-tokens <MAX_WAITING_TOKENS>\n          This setting defines how many tokens can be passed before forcing the waiting queries to be put on the batch (if the size of the batch allows for it). New queries require 1 `prefill` forward, which is different from `decode` and therefore you need to pause the running batch in order to run `prefill` to create the correct values for the waiting queries to be able to join the batch.\n\n          With a value too small, queries will always \"steal\" the compute to run `prefill` and running queries will be delayed by a lot.\n\n          With a value too big, waiting queries could wait for a very long time before being allowed a slot in the running batch. If your server is busy that means that requests that could run in ~2s on an empty server could end up running in ~20s because the query had to wait for 18s.\n\n          This number is expressed in number of tokens to make it a bit more \"model\" agnostic, but what should really matter is the overall latency for end users.\n\n          [env: MAX_WAITING_TOKENS=]\n          [default: 20]\n\n```", "```py\n      --max-batch-size <MAX_BATCH_SIZE>\n          Enforce a maximum number of requests per batch Specific flag for hardware targets that do not support unpadded inference\n\n          [env: MAX_BATCH_SIZE=]\n\n```", "```py\n      --enable-cuda-graphs\n          Enable experimental support for cuda graphs\n\n          [env: ENABLE_CUDA_GRAPHS=]\n\n```", "```py\n      --hostname <HOSTNAME>\n          The IP address to listen on\n\n          [env: HOSTNAME=]\n          [default: 0.0.0.0]\n\n```", "```py\n  -p, --port <PORT>\n          The port to listen on\n\n          [env: PORT=]\n          [default: 3000]\n\n```", "```py\n      --shard-uds-path <SHARD_UDS_PATH>\n          The name of the socket for gRPC communication between the webserver and the shards\n\n          [env: SHARD_UDS_PATH=]\n          [default: /tmp/text-generation-server]\n\n```", "```py\n      --master-addr <MASTER_ADDR>\n          The address the master shard will listen on. (setting used by torch distributed)\n\n          [env: MASTER_ADDR=]\n          [default: localhost]\n\n```", "```py\n      --master-port <MASTER_PORT>\n          The address the master port will listen on. (setting used by torch distributed)\n\n          [env: MASTER_PORT=]\n          [default: 29500]\n\n```", "```py\n      --huggingface-hub-cache <HUGGINGFACE_HUB_CACHE>\n          The location of the huggingface hub cache. Used to override the location if you want to provide a mounted disk for instance\n\n          [env: HUGGINGFACE_HUB_CACHE=]\n\n```", "```py\n      --weights-cache-override <WEIGHTS_CACHE_OVERRIDE>\n          The location of the huggingface hub cache. Used to override the location if you want to provide a mounted disk for instance\n\n          [env: WEIGHTS_CACHE_OVERRIDE=]\n\n```", "```py\n      --disable-custom-kernels\n          For some models (like bloom), text-generation-inference implemented custom cuda kernels to speed up inference. Those kernels were only tested on A100\\. Use this flag to disable them if you're running on different hardware and encounter issues\n\n          [env: DISABLE_CUSTOM_KERNELS=]\n\n```", "```py\n      --cuda-memory-fraction <CUDA_MEMORY_FRACTION>\n          Limit the CUDA available memory. The allowed value equals the total visible memory multiplied by cuda-memory-fraction\n\n          [env: CUDA_MEMORY_FRACTION=]\n          [default: 1.0]\n\n```", "```py\n      --rope-scaling <ROPE_SCALING>\n          Rope scaling will only be used for RoPE models and allow rescaling the position rotary to accomodate for larger prompts.\n\n          Goes together with `rope_factor`.\n\n          `--rope-factor 2.0` gives linear scaling with a factor of 2.0 `--rope-scaling dynamic` gives dynamic scaling with a factor of 1.0 `--rope-scaling linear` gives linear scaling with a factor of 1.0 (Nothing will be changed basically)\n\n          `--rope-scaling linear --rope-factor` fully describes the scaling you want\n\n          [env: ROPE_SCALING=]\n          [possible values: linear, dynamic]\n\n```", "```py\n      --rope-factor <ROPE_FACTOR>\n          Rope scaling will only be used for RoPE models See `rope_scaling`\n\n          [env: ROPE_FACTOR=]\n\n```", "```py\n      --json-output\n          Outputs the logs in JSON format (useful for telemetry)\n\n          [env: JSON_OUTPUT=]\n\n```", "```py\n      --otlp-endpoint <OTLP_ENDPOINT>\n          [env: OTLP_ENDPOINT=]\n\n```", "```py\n      --cors-allow-origin <CORS_ALLOW_ORIGIN>\n          [env: CORS_ALLOW_ORIGIN=]\n\n```", "```py\n      --watermark-gamma <WATERMARK_GAMMA>\n          [env: WATERMARK_GAMMA=]\n\n```", "```py\n      --watermark-delta <WATERMARK_DELTA>\n          [env: WATERMARK_DELTA=]\n\n```", "```py\n      --ngrok\n          Enable ngrok tunneling\n\n          [env: NGROK=]\n\n```", "```py\n      --ngrok-authtoken <NGROK_AUTHTOKEN>\n          ngrok authentication token\n\n          [env: NGROK_AUTHTOKEN=]\n\n```", "```py\n      --ngrok-edge <NGROK_EDGE>\n          ngrok edge\n\n          [env: NGROK_EDGE=]\n\n```", "```py\n      --tokenizer-config-path <TOKENIZER_CONFIG_PATH>\n          The path to the tokenizer config file. This path is used to load the tokenizer configuration which may include a `chat_template`. If not provided, the default config will be used from the model hub\n\n          [env: TOKENIZER_CONFIG_PATH=]\n\n```", "```py\n  -e, --env\n          Display a lot of information about your runtime environment\n\n```", "```py\n  -h, --help\n          Print help (see a summary with '-h')\n\n```", "```py\n  -V, --version\n          Print version\n\n```"]